Revit 2024 API
EnergyAnalysisSurfaceType Enumeration
 Analytical surface types.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Since: 2012
Syntax
C#
public enum EnergyAnalysisSurfaceType
Visual Basic
Public Enumeration EnergyAnalysisSurfaceType
Visual C++
public enum class EnergyAnalysisSurfaceType
Members
Member name | Description
Roof |  Roof.
ExteriorWall |  Exterior wall.
InteriorWall |  Interior wall.
Ceiling |  Ceiling.
InteriorFloor |  Interior floor.
ExteriorFloor |  Exterior floor.
Shading |  Shading.
Air |  Air.
Underground |  Underground
See Also
Autodesk.Revit.DB.Analysis Namespace